require 'i18n'

I18n.load_path = Dir['../locale/*.yml']
I18n.backend.load_translations

I18n.config.available_locales = :en

arabic = 'والفكرية اليهودية في العصور الوسطى. ارتفعتْ مكانةُ اللغةِ العربية إثْرَ انتشارِ الإسلام بين الدول إذ أصبحت لغة السياسة والعلم والأدب لقرون طويلة في الأراضي التي حكمها المسلمون. وللغة العربية تأثير مباشر وغير مباشر على كثير من اللغات الأخرى في العالم الإسلامي، كالتركية والفارسية والأمازيغية والكردية والأردية والماليزية والإندونيسية والألبانية وبعض اللغات الإفريقية الأخرى مثل الهاوسا والسواحيلية والتجرية والأمهرية والصومالية، وبعض اللغات الأوروبية وخاصةً المتوسطية كالإسبانية والبرتغالية والمالطية والصقلية؛ ودخلت الكثير من مصطلحاتها في اللغة الإنجليزية واللغات الأخرى، مثل أدميرال والتعريفة والكحول والجبر وأسماء النجوم. كما أنها تُدرَّس بشكل رسمي أو غير رسمي في الدول الإسلامية والدول الإفريقية المحاذية للوطن العربي.'
farsi = 'اربری (صرف) فعل در این زبان به دو زمان گذشته (ماضی) و حال (مضارع) است که با کمک صیغهٔ مضارع صیغه‌های آینده (مستقبل) هم ساخته می‌شود؛ و هر کدام از این دسته‌ها چهارده صیغه است. زبان عربی به دلیل قالب‌ها و حالات صرفی و نحوی و داشتن مذکر و مؤنث و سایر قواعد دستوری یکی از سخت‌ترین زبان‌های دنیا به ویژه برای سخن گفتنست. از آنجا که زبان انگلیسی این پیچیدگی‌ها را ندارد و با دانستن تنها ۵۰۰ واژه می‌توان نیازهای روزانه را با آن پیش‌برد، در بیشتر کشورهای عربی فرانسه و انگلیسی زبان رایجست. در حوزهٔ کشورهای عربی خلیج فارس عملاً زبان کار زبان انگلیسی'

missing_letters = '()ٔ‌.َِّْ'

p I18n.transliterate(  arabic.gsub( /[#{missing_letters}]/, '' ) )
p I18n.transliterate(  arabic )

puts

p I18n.transliterate(  farsi.gsub( /[#{missing_letters}]/, '' ) )
p I18n.transliterate(  farsi )

puts

all_characters = I18n.backend.translations[:en][:i18n][:transliterate][:rule].keys.map{ |e| e.to_s }

missing_arabic = arabic.gsub( /[#{missing_letters}]/, '' ).split( '' ).uniq - all_characters
p missing_arabic

missing_farsi = farsi.gsub( /[#{missing_letters}]/, '' ).split( '' ).uniq - all_characters
p (missing_farsi + missing_arabic).uniq.map{ |e| e.ord }

